#include "globalVar.h"


FILE *stuFileptr=NULL;//登入学生的文件指针

Student *student=NULL; //登入学生

FILE *workerFileptr=NULL;//登入职工的文件指针

int isStudent=0;//学生或职工

int isAdmin=0;//教师或管理员

int lineNumber=0;//学生在文件中的位置

stu_list *find_result[100]={NULL};//查找结果

char *STU_FILE = "D:/c++/Qt/ScoreManagementSystem/studentInfo.txt";//学生文件位置

char *ADMIN_FILE = "D:/c++/Qt/ScoreManagementSystem/adminInfo.txt"; //教师文件位置

const char allCourses[100][100] =
{
    //基础课程
"大学英语",//0
"微积分",
"线性代数",
"离散数学",
"思想道德与法治",
"中国近代史纲要",//5
"形势与政策",
"军事理论",
"军事训练",
"大学体育",
//
"基础物理学",//10
"数据结构",
"计算机组成原理",
"计算机专业英语",
"算法设计与分析",
"操作系统",//15
"计算机职业道德与学术技能",
"RFID 原理与应用",
"数据库系统原理（双语）",
"计算机网络",
//物联网
"无线传感器网络",//20
"物联网控制技术",
"嵌入式系统设计",
"物联网安全",
"无线网络技术 ",
"传感器技术",//25
"物联网应用系统设计",
"Java 程序设计",
"Linux 实践",
"人工智能基础*",
"智能信息处理技术*",//30
"软件工程概论",
"云计算技术 A*",
"大数据技术与应用",
"多传感器信息融合",
"地理信息系统",//35
"嵌入式设备驱动",
"人机交互技术",
"车联网技术与应用*",
"嵌入式中间件技术",
"软件项目管理",//40
"网络搜索引擎",
"机器人设计与应用",
"水声传感网",
//网络安全
"信息安全数学基础",
"网络空间安全前沿、法规与专业技能",//45
"IA32架构汇编语言程序设计",
"应用密码学",
"计算机安全",
"隐私保护",
"网络安全*",//50
"安全编程*",
"数据库安全",
"程序安全检测技术",
"编译原理与实现",
//计科
"计算机系统结构",//55
"微机系统",
"软件工程",
"计算机硬件系统设计实验",
"数据结构课程设计",
"数据库系统原理课程设计",//60
"网络协议分析实验B",
"编译原理课程设计",
"软件工程课程设计",
"计算机硬件系统设计实验II",
"CPU设计实验",//65
"微机系统与接口实验",
"单片机控制与应用实验",
//电子学院（基础）
"微机原理与系统设计",
"微机原理与系统设计实验",
"电路分析基础",//70
"工程制图 B",
"模拟电子技术",
"数字电子技术",
//电子信息
"传感器技术与应用",
"信号与系统",//75
"单片机原理与应用",
"数字信号处理",
"微波原理与技术",
"通信原理",
"嵌入式系统",//80
//微电子和电子科学
"半导体物理",
"半导体材料",
"半导体器件物理",
//微电
"数字集成电路设计",//85
"模拟集成电路设计",
"微电子工艺原理",
"HDL 语言与 ASIC 原理",
//电子科学
"材料特性表征",
//化学
"无机化学",//90
"分析化学",
"有机化学",
"物理化学",
"高分子化学",
//法学院
"法理学",//95
"宪法学",
"中国法制史",
"刑法学",
"民法学",
};

const float credits[100] = {
4,//0
3.5,
2.5,
3.5,
2,
2,//5
2,
2,
2,
2,
2,//10
5,
3,
2,
3.5,
4,//15
1,
2,
3,
3,
3,//20
2.5,
3,
3,
3,
2,//25
1,
2.5,
2,
2,
2.5,//30
2,
3,
2.5,
2,
2,//35
2,
2,
2,
2,
2,//40
2,
2,
2,
3.5,
1.5,//45
2.5,
3.5,
2,
2,
2,//50
2,
2,
2,
3,
2,//55
3.5,
2.5,
1.5,
1,
1,//60
1,
1,
1,
2,
2,//65
2,
2,
//
3.5,
1,
4,//70
2.5,
3.5,
3.5,
2,
4,//75
3.5,
3.5,
3.5,
3.5,
3.5,//80
4,
3,
4,
3,
3,//85
2,
3,
3,
6,//90
2.5,
6,
6,
3,
6,//95
4,
4,
9,
12,
};

const char colleges[MAX_COLLEGE_COUNT][MAX_NAME_LENGTH] = {
    "计算机科学与技术学院",
    "电子科学与技术学院",
    "化学学院",
    "法学院",
    // 其他学院名称可以继续添加
};

const char majors[MAX_COLLEGE_COUNT][MAX_MAJOR_PER_COLLEGE][MAX_NAME_LENGTH] = {
    //计算机科学与技术学院
    {
        "计算机科学与技术",
        "物联网工程",
        "网络安全"
        // 其他专业名称可以继续添加
    },
    //电子科学与技术学院
    {
        "电子信息",
        "微电子",
        "电子科学与技术",
        // 其他专业名称可以继续添加
    },
    //化学学院
    {
        "化学",
        // 其他专业名称可以继续添加
    },
    //法学院
    {
        "法学",
    },
    // 其他学院的专业信息可以继续添加
};

const int majorCourses[MAX_COLLEGE_COUNT][MAX_MAJOR_PER_COLLEGE][MAX_COURSES_PER_MAJOR] = {
    //计算机科学与技术学院
    {
        // 计算机科学与技术专业
        {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 19, 56, 57, 58, 66, 67, 68, 0},
                // 物联网工程专业
        {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 19, 21, 22, 23, 24, 25, 26, 0},
                // 网络安全专业
        {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 19, 45, 47, 48, 49, 50, 51, 0},
    },
    //电子科学与技术学院
    {
        // 电子信息专业
       {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 0},
                // 微电子专业
       {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 69, 70, 71, 72, 73, 74, 82, 83, 84, 86, 87, 88, 89, 0},
                // 电子科学与技术
       {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 69, 70, 71, 72, 73, 74, 82, 83, 84, 90, 0},
    },
    //化学学院
    {
        // 化学专业
        {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 91, 92, 93, 94, 95, 0},
    },
      // 法学院
        {
        // 法学专业
        {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 96, 97, 98, 99, 100, 0},
    }
};
